[
  {"doric_the_crafter_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start Doric The Crafter quest!", "hint_1": "Doric the Crafter quest is in progress! Try and finish that before continuing."}},
  {"the_gem_seeker_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start The Gem Seeker quest!", "hint_1": "The Gem Seeker quest is in progress! Try and finish that before continuing."}},
  {"the_achiever_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start The Achiever quest!", "hint_1": "The Achiever quest is in progress! Try and finish that before continuing."}},
  {"stardust_expert_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start Stardust Expert quest!", "hint_1": "Stardust Expert quest is in progress! Try and finish that before continuing."}},
  {"combat_tutor_quest": {"requirements": 0, "hint_0": "Purchase any weapon and start the Combat Tutor quest!", "hint_1": "Combat Tutor quest is in progress! Try and finish that before continuing."}},
  {"ent_boss_quest": {"requirements": 0, "hint_0": "If you haven't already, unlock the Ent Boss quest by fighting in the forest and then try your luck!", "hint_1": "Ent Boss quest is in progress! If you're having trouble, try using a bow and arrows."}},
  {"faradoxs_introduction_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start Faradox's Introduction quest! Get your staff at the ready!", "hint_1": "Faradox's Introduction quest is in progress! Try and finish that before continuing."}},
  {"fisherman_quest": {"requirements": {"bad_fishing_net_used":  1}, "hint_req": "It's time to unlock fishing! Go squash some pesky spiders, make a net from string (click on it) and try using it!", "hint_0": "Go to the Quests page to start The Fisherman quest!", "hint_1": "The Fisherman quest is in progress! Try and finish that before continuing."}},
  {"combat_collection_log_quest": {"requirements": {"wolf_kills":  ">=1"}, "hint_req": "Venture into the forest and slay a wolf so you can start the Combat Collection Log Quest!", "hint_0": "Go to the Quests page to start Combat Collection Log quest!", "hint_1": "Combat Collection Log quest is in progress! Try and finish that before continuing."}},
  {"tank_boss_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start Tank Boss quest!", "hint_1": "Tank Boss quest is in progress! If you're having trouble, try getting a poisoned weapon."}},
  {"thief_leader_quest": {"requirements": {"thief_kills":  ">=3"}, "hint_req": "Kill 3 thieves to unlock the Thief Leader quest! Money burning a hole in your pocket? Try brewing some Monster Select potions.", "hint_0": "Go to the Quests page to start Thief Leader quest!", "hint_1": "Thief Leader quest is in progress! Try and finish that before continuing."}},
  {"dad_goblin_quest": {"requirements": 0, "hint_0": "Go to the Quests page to start Dad Goblin quest!", "hint_1": "Kill some goblins for a mask. If you have that already, after talking to Dad Goblin go fight some more goblins."}},
  {"combat_presets_quest": {"requirements": {"fire_casted":  ">=5"}, "hint_req": "", "hint_0": "Go to the Quests page to complete Combat Presets quest!", "hint_1": "Combat Presets quest is in progress! Try and finish that before continuing."}},
  {"shiny_resources_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Shiny Resources quest!", "hint_1": "Shiny Resources quest is in progress! Try and finish that before continuing."}},
  {"fire_witch_sister_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Fire Witch Sister quest!", "hint_1": "Fire Witch Sister quest is in progress! Try and finish that before continuing."}},
  {"the_carpenter_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete The Carpenter quest!", "hint_1": "The Carpenter quest is in progress! Try and finish that before continuing."}},
  {"the_four_crystals_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete The Four Crystals quest!", "hint_1": "The Four Crystals quest is in progress! Try and finish that before continuing."}},
  {"ghost_miner_boss_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Ghost Miner Boss quest!", "hint_1": "Ghost Miner Boss quest is in progress! Try and finish that before continuing."}},
  {"bob_the_farmer_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Bob The Farmer quest!", "hint_1": "Bob The Farmer quest is in progress! Try and finish that before continuing."}},
  {"junk_collector_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Junk Collector quest!", "hint_1": "Junk Collector quest is in progress! Try and finish that before continuing."}},
  {"the_merchant_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete The Merchant quest!", "hint_1": "The Merchant quest is in progress! Try and finish that before continuing."}},
  {"junk_planet_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Junk Planet quest!", "hint_1": "Junk Planet quest is in progress! Try and finish that before continuing."}},
  {"faradox_attempt_quest": {"requirements": 0, "hint_0": "Go to the Quests page to complete Faradox Attempt quest!", "hint_1": "Faradox Attempt quest is in progress! Try and finish that before continuing."}}
]
